/* automatically generated by rust-bindgen 0.72.0 */

pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
pub const CARO_PARTICIPANT_CARO_PLAYER1: CARO_PARTICIPANT = 0;
pub const CARO_PARTICIPANT_CARO_PLAYER2: CARO_PARTICIPANT = 1;
pub type CARO_PARTICIPANT = ::std::os::raw::c_uint;
pub const CARO_RULE_TYPE_CARO_TIC_TAC_TOE: CARO_RULE_TYPE = 0;
pub const CARO_RULE_TYPE_CARO_FOUR_BLOCK_1: CARO_RULE_TYPE = 1;
pub const CARO_RULE_TYPE_CARO_FIVE_BLOCK_2: CARO_RULE_TYPE = 2;
pub type CARO_RULE_TYPE = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CARO_Coordinate {
    pub latitude: ::std::os::raw::c_long,
    pub longtitude: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CARO_Coordinate"][::std::mem::size_of::<CARO_Coordinate>() - 16usize];
    ["Alignment of CARO_Coordinate"][::std::mem::align_of::<CARO_Coordinate>() - 8usize];
    ["Offset of field: CARO_Coordinate::latitude"]
        [::std::mem::offset_of!(CARO_Coordinate, latitude) - 0usize];
    ["Offset of field: CARO_Coordinate::longtitude"]
        [::std::mem::offset_of!(CARO_Coordinate, longtitude) - 8usize];
};
pub const CARO_TILE_STATE_CARO_TILE_EMPTY: CARO_TILE_STATE = 0;
pub const CARO_TILE_STATE_CARO_TILE_PLAYER1: CARO_TILE_STATE = 1;
pub const CARO_TILE_STATE_CARO_TILE_PLAYER2: CARO_TILE_STATE = 2;
pub type CARO_TILE_STATE = ::std::os::raw::c_uint;
pub const CARO_MOVE_RESULT_CARO_SUCCESS: CARO_MOVE_RESULT = 0;
pub const CARO_MOVE_RESULT_CARO_ALREADY_OCCUPIED: CARO_MOVE_RESULT = 1;
pub const CARO_MOVE_RESULT_CARO_WRONG_TURN: CARO_MOVE_RESULT = 2;
pub const CARO_MOVE_RESULT_CARO_OUT_OF_BOUNDS: CARO_MOVE_RESULT = 3;
pub type CARO_MOVE_RESULT = ::std::os::raw::c_uint;
pub const CARO_GAME_STATE_CARO_PLAYER1_TURN: CARO_GAME_STATE = 0;
pub const CARO_GAME_STATE_CARO_PLAYER2_TURN: CARO_GAME_STATE = 1;
pub const CARO_GAME_STATE_CARO_PLAYER1_WON: CARO_GAME_STATE = 2;
pub const CARO_GAME_STATE_CARO_PLAYER2_WON: CARO_GAME_STATE = 3;
pub const CARO_GAME_STATE_CARO_DREW: CARO_GAME_STATE = 4;
pub const CARO_GAME_STATE_CARO_NOT_INPROGRESS: CARO_GAME_STATE = 5;
pub type CARO_GAME_STATE = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CARO_Board_Line {
    pub board_line: *mut CARO_TILE_STATE,
    pub length: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CARO_Board_Line"][::std::mem::size_of::<CARO_Board_Line>() - 16usize];
    ["Alignment of CARO_Board_Line"][::std::mem::align_of::<CARO_Board_Line>() - 8usize];
    ["Offset of field: CARO_Board_Line::board_line"]
        [::std::mem::offset_of!(CARO_Board_Line, board_line) - 0usize];
    ["Offset of field: CARO_Board_Line::length"]
        [::std::mem::offset_of!(CARO_Board_Line, length) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CARO_Moves_Set {
    pub moves_set: *mut CARO_Coordinate,
    pub length: usize,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of CARO_Moves_Set"][::std::mem::size_of::<CARO_Moves_Set>() - 16usize];
    ["Alignment of CARO_Moves_Set"][::std::mem::align_of::<CARO_Moves_Set>() - 8usize];
    ["Offset of field: CARO_Moves_Set::moves_set"]
        [::std::mem::offset_of!(CARO_Moves_Set, moves_set) - 0usize];
    ["Offset of field: CARO_Moves_Set::length"]
        [::std::mem::offset_of!(CARO_Moves_Set, length) - 8usize];
};
unsafe extern "C" {
    pub fn caro_init_game() -> ::std::os::raw::c_int;
}
unsafe extern "C" {
    pub fn caro_deinit_game(gid_: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn caro_set_board_size(gid_: ::std::os::raw::c_int, width_: usize, height_: usize);
}
unsafe extern "C" {
    pub fn caro_get_board_width(gid_: ::std::os::raw::c_int) -> usize;
}
unsafe extern "C" {
    pub fn caro_get_board_height(gid_: ::std::os::raw::c_int) -> usize;
}
unsafe extern "C" {
    pub fn caro_set_rule(gid_: ::std::os::raw::c_int, rule_: CARO_RULE_TYPE);
}
unsafe extern "C" {
    pub fn caro_unset_rule(gid_: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn caro_start(gid_: ::std::os::raw::c_int, first_turn_: CARO_GAME_STATE);
}
unsafe extern "C" {
    pub fn caro_stop(gid_: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn caro_player_move(
        gid_: ::std::os::raw::c_int,
        who_: CARO_PARTICIPANT,
        move_: CARO_Coordinate,
    ) -> CARO_MOVE_RESULT;
}
unsafe extern "C" {
    pub fn caro_player_undo(
        gid_: ::std::os::raw::c_int,
        who_: CARO_PARTICIPANT,
    ) -> CARO_MOVE_RESULT;
}
unsafe extern "C" {
    pub fn caro_player_redo(
        gid_: ::std::os::raw::c_int,
        who_: CARO_PARTICIPANT,
    ) -> CARO_MOVE_RESULT;
}
unsafe extern "C" {
    pub fn caro_switch_turn(gid_: ::std::os::raw::c_int);
}
unsafe extern "C" {
    pub fn caro_occupied_tiles_count(gid_: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
}
unsafe extern "C" {
    pub fn caro_get_board_row(
        gid_: ::std::os::raw::c_int,
        data_: *mut CARO_Board_Line,
        latitude_: usize,
    );
}
unsafe extern "C" {
    pub fn caro_get_board_column(
        gid_: ::std::os::raw::c_int,
        data_: *mut CARO_Board_Line,
        longtitude_: usize,
    );
}
unsafe extern "C" {
    pub fn caro_get_tile_state(
        gid_: ::std::os::raw::c_int,
        latitude_: usize,
        longtitude_: usize,
    ) -> CARO_TILE_STATE;
}
unsafe extern "C" {
    pub fn caro_get_state(gid_: ::std::os::raw::c_int) -> CARO_GAME_STATE;
}
unsafe extern "C" {
    pub fn caro_is_over(gid_: ::std::os::raw::c_int) -> bool;
}
unsafe extern "C" {
    pub fn caro_get_moves_history(
        gid_: ::std::os::raw::c_int,
        data_: *mut CARO_Moves_Set,
        who_: CARO_PARTICIPANT,
    );
}
unsafe extern "C" {
    pub fn caro_get_undone_moves(
        gid_: ::std::os::raw::c_int,
        data_: *mut CARO_Moves_Set,
        who_: CARO_PARTICIPANT,
    );
}
unsafe extern "C" {
    pub fn caro_free_board_line(data_: *mut CARO_Board_Line);
}
unsafe extern "C" {
    pub fn caro_free_move_set(data_: *mut CARO_Moves_Set);
}
